---
kind: property
id: P:Autodesk.Revit.DB.FabricationPart.SheetMetalArea
source: html/f66b0b5c-531e-cc49-d902-d19cea6e34ac.htm
---
# Autodesk.Revit.DB.FabricationPart.SheetMetalArea Property

The sheet metal area of the fabrication part.

## Syntax (C#)
```csharp
public double SheetMetalArea { get; }
```